[
    {
        "name": "Happy Tails v2.0",
        "description": "Happy Tails 2.0 is a task tracking site for animal shelters that was created using React and Apollo Provider.  The version 2.0 includes both new added features and higher performance compared to the original Happy Tails.  Some added features include: an admin user model which has additional actions, a donate page, ability for admin to add dogs, admin can activate or inactivate a dog or user profile. This site is currently hosted on Heroku and can also be run locally using the files in its GitHub repository. To learn how to run this server locally please visit the GitHub repo and read the Installation and Usage sections in the README.md.",
        "url": "https://happytails-v2.herokuapp.com/",
        "photo": "http://nystephens.github.io/react-portfolio/images/happy-tails-v2.png",
        "github": "https://github.com/nystephens/happytails-v2"
    },
    {
        "name": "Called to Greatness",
        "description": "A WordPress site for a family owned insurance agency.  Complete with user access tiers and restricted content. ",
        "url": "https://ctg-php.com/",
        "photo": "http://nystephens.github.io/react-portfolio/images/ctg-logo.png",
        "github": "https://gist.github.com/nystephens/293512eb4f605148364e3fcde7eb6ff0"
    },
    {
        "name": "Cubestream",
        "description": "Did frontend work for a startup streaming site.  My role was to bring the design for the upload page and user sidebar to match the FIGMA design.",
        "url": "https://cubestream.com/signin.php?invite=uiQZK5I8J9h21aNSwTpQ&tag=vVlwlb4AME7bQzFSJulMfA%3D%3D&fbclid=IwAR1Vb2bGBNxf97Wk5opfP3_kZKHXhmGj6b5QMCviR1vD6VY83Uq3wf_icF0",
        "photo": "http://nystephens.github.io/react-portfolio/images/cubestream-banner.jpg",
        "github": "https://gist.github.com/nystephens/b5c5d6986e18422b18c6943e2a53880a"
    },
    {
        "name": "Surf Forecast",
        "description": "This app finds current surf conditions for beaches along the OC/LA coastline.  By selecting one of our 7 tracked beach locations a user will recieve a simplified layout of relevant surf and weather conditions for their selected beach.  A gif is also displayed in relation to the surf conditions to add to a fun experience and stylish user interface.",
        "url": "https://shellienguyen.github.io/surf-forecast/",
        "photo": "http://nystephens.github.io/react-portfolio/images/surf-forecast2.png",
        "github": "https://github.com/shellienguyen/surf-forecast"
    },
    {
        "name": "Weather Dashboard",
        "description": "A web app that displays up to date weather statistics and predictions. The user is able to type a city name into the search bar and when their search query submitted, the users input is used as a search term to fetch data from the Open Weather API. Data for that corresponding city is then fetched and populated onto the page in a readable graphic dashboard.",
        "url": "https://nystephens.github.io/weather-dashboard/",
        "photo": "http://nystephens.github.io/react-portfolio/images/weather-dashboard.png",
        "github": "https://github.com/nystephens/weather-dashboard"

    },
    {
        "name": "MVC Tech Blog",
        "description": "This is a basic CMS-style blog site that was created using the Model, View, Controller paradigm. This site is currently hosted on Heroku and can also be run locally using the files located in its GitHub repository. To learn how to run this server locally please visit the GitHub repo and read the Installation and Usage sections in the README.md. This application was created using Node.js, express for the server, and sequelize to connect to a mysql database entitled \"tech_blog_db\". All user, post, and comment data is stored in tech_blog_db. The live app is currently deployed on Heroku, using the JAWSDB add on to store data. All passwords have been encrypted using the bcrypt Node.js package. The HTML views templates are generated using Handlebars.js.",
        "url": "https://powerful-wave-29911.herokuapp.com/",
        "photo": "http://nystephens.github.io/react-portfolio/images/mvc-tech-blog.png",
        "github": "https://github.com/nystephens/mvc-tech-blog"
    }
]